{
  "jurassic_dinosaurs": [
    {
      "id": 1,
      "name": "Allosaurus",
      "description": "Allosaurus is an extinct genus of large theropod dinosaur that lived 155 to 145 million years ago during the Late Jurassic period. The name 'Allosaurus' means 'different lizard', alluding to its unique concave vertebrae. It was one of the largest predators of its time, with a large skull and sharp teeth.",
      "size": "9 meters long",
      "weight": "2.3 tons",
      "diet": "carnivore",
      "location": "North America, Europe, Africa",
      "image": "https://i0.wp.com/onlydinosaurs.com/wp-content/uploads/2021/10/An-orange-Allosaurs-is-walking-on-the-grass-1536x864.jpg"
    },
    {
      "id": 2,
      "name": "Apatosaurus",
      "description": "Apatosaurus is a genus in the family Diplodocidae. It is one of the more basal genera, with only Amphicoelias and possibly a new, unnamed genus more primitive. Although the subfamily Apatosaurinae was named in 1929, the group was not used validly until an extensive 2015 study.",
      "size": "23 meters long",
      "weight": "20 tons",
      "diet": "herbivore",
      "location": "North America",
      "image": "https://upload.wikimedia.org/wikipedia/commons/4/44/Apatosaurus_louisae_by_durbed.jpg"
    },
    {
      "id": 3,
      "name": "Archaeopteryx",
      "description": "Archaeopteryx lived in the Late Jurassic, around 150 million years ago, in what is now southern Germany. It is considered a transitional fossil between non-avian dinosaurs and modern birds, showcasing both reptilian and avian features.",
      "size": "0.5 meters long",
      "weight": "1 kg",
      "diet": "carnivore",
      "location": "Europe",
      "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5f/Archaeopteryx_UDL.png/1920px-Archaeopteryx_UDL.png"
    },
    {
      "id": 4,
      "name": "Brachiosaurus",
      "description": "Brachiosaurus is a typical sauropod, with a long neck and tail, and an enormous body supported by four tree-trunk-like legs. The first Brachiosaurus specimen was discovered in 1900 in Colorado, USA, by American paleontologist Elmer S. Riggs.",
      "size": "22 meters long",
      "weight": "50 tons",
      "diet": "herbivore",
      "location": "North America, Africa",
      "image": "https://upload.wikimedia.org/wikipedia/commons/0/07/Brachiosaurus_altithorax_side_profile.png"
    },
    {
      "id": 5,
      "name": "Brontosaurus",
      "description": "Brontosaurus is a genus of herbivorous sauropod dinosaur that lived in present-day United States during the Late Jurassic. Originally considered a synonym of Apatosaurus, it was revalidated as a distinct genus in a 2015 study. It was first described by paleontologist Othniel Charles Marsh in 1879.",
      "size": "22 meters long",
      "weight": "16 tons",
      "diet": "herbivore",
      "location": "North America",
      "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/11/Brontosaurus_by_Tom_Parker.png/1920px-Brontosaurus_by_Tom_Parker.png"
    },
    {
      "id": 6,
      "name": "Camarasaurus",
      "description": "Camarasaurus is a genus of sauropod dinosaur from the Late Jurassic period in North America. It was one of the most common sauropods in the Morrison Formation, characterized by its boxy skull and spoon-shaped teeth.",
      "size": "18 meters long",
      "weight": "45 tons",
      "diet": "herbivore",
      "location": "North America",
      "image": "https://en.wikipedia.org/wiki/Camarasaurus#/media/File:Camarasaurs1.jpg"
    },
    {
      "id": 7,
      "name": "Camptosaurus",
      "description": "Camptosaurus is a genus of herbivorous ornithopod dinosaur that lived during the Late Jurassic period, around 150 million years ago. It had a beak-like mouth adapted for cropping plants and could walk both on two legs and all fours. Its name means 'bent lizard', referring to the curved bones in its hips.",
      "size": "6 meters long",
      "weight": "1 ton",
      "diet": "herbivore",
      "location": "North America, Europe",
      "image": "https://en.wikipedia.org/wiki/Camptosaurus#/media/File:Camptosaurus.jpg"
    },
    {
      "id": 8,
      "name": "Ceratosaurus",
      "description": "Ceratosaurus was a medium-sized theropod dinosaur that lived during the Late Jurassic period. It is known for its distinctive nasal horn and two small horn-like ridges above its eyes. Its deep jaws housed long, blade-like teeth, making it a formidable predator.",
      "size": "6 meters long",
      "weight": "600 kg",
      "diet": "carnivore",
      "location": "North America",
      "image": "https://en.wikipedia.org/wiki/Ceratosaurus#/media/File:Ceratosaurus_nasicornis_DB.jpg"
    },
    {
      "id": 9,
      "name": "Compsognathus",
      "description": "Compsognathus is a genus of small, bipedal, carnivorous theropod dinosaur. Members of its single species Compsognathus longipes could grow to around the size of a chicken. They lived about 150 million years ago, during the Tithonian age of the late Jurassic period, in what is now Europe.",
      "size": "1 meter long",
      "weight": "2 kg",
      "diet": "carnivore",
      "location": "Europe",
      "image": "https://en.wikipedia.org/wiki/Compsognathus#/media/File:Compsognathus_BW.jpg"
    },
    {
      "id": 10,
      "name": "Dilophosaurus",
      "description": "Dilophosaurus is a genus of theropod dinosaurs that lived in what is now North America during the Early Jurassic, about 186 million years ago. Three skeletons were discovered in northern Arizona in 1940, and the two best preserved were collected in 1942.",
      "size": "7 meters long",
      "weight": "400 kg",
      "diet": "carnivore",
      "location": "North America",
      "image": "https://en.wikipedia.org/wiki/Dilophosaurus#/media/File:Dilophosaurus_wetherilli.PNG"
    },
    {
      "id": 11,
      "name": "Diplodocus",
      "description": "Diplodocus is an extinct genus of diplodocid sauropod dinosaurs known from the Late Jurassic of North America. The first fossils of Diplodocus were discovered in 1877 by S. W. Williston. The name 'Diplodocus' means 'double beam', referring to the double-beamed chevron bones found in its tail.",
      "size": "25 meters long",
      "weight": "13 tons",
      "diet": "herbivore",
      "location": "North America",
      "image": "https://upload.wikimedia.org/wikipedia/commons/0/08/Diplodocus_carnegii.jpg"
    },
    {
      "id": 12,
      "name": "Huayangosaurus",
      "description": "Huayangosaurus is a genus of stegosaurian dinosaur from the Middle Jurassic of China. It lived during the Bathonian to Callovian stages, around 165 million years ago, some 20 million years before its famous relative, Stegosaurus appeared in North America. At only approximately 4 metres (13 ft) long, it was also much smaller than its famous cousin.",
      "size": "4 meters long",
      "weight": "500 kg",
      "diet": "herbivore",
      "location": "Asia",
      "image": "https://en.wikipedia.org/wiki/Huayangosaurus#/media/File:Huayangosaurus_BW.jpg"
    },
    {
      "id": 13,
      "name": "Kentrosaurus",
      "description": "Kentrosaurus is a genus of stegosaurid dinosaur from the Late Jurassic in Lindi Region of Tanzania. The type species is K. aethiopicus, named and described by German palaeontologist Edwin Hennig in 1915. Kentrosaurus was a relatively small stegosaur, with a length of about 4 meters (13 ft) and a weight of about 1 ton.",
      "size": "4 meters long",
      "weight": "1 ton",
      "diet": "herbivore",
      "location": "Africa",
      "image": "https://en.wikipedia.org/wiki/Kentrosaurus#/media/File:Kentrosaurus_aethiopicus.png"
    },
    {
      "id": 14,
      "name": "Lesothosaurus",
      "description": "Lesothosaurus is a monospecific genus of ornithischian dinosaur that lived during the Early Jurassic in what is now South Africa and Lesotho. The genus has only one valid species, Lesothosaurus diagnosticus. Lesothosaurus is one of the most completely-known early ornithischians, based on numerous skull and postcranial fossils from the Upper Elliot Formation.",
      "size": "2 meters long",
      "weight": "15 kg",
      "diet": "herbivore",
      "location": "Africa",
      "image": "https://en.wikipedia.org/wiki/Lesothosaurus#/media/File:Lesothosaurus_diagnosticus.png"
    },
    {
      "id": 15,
      "name": "Megalosaurus",
      "description": "Megalosaurus is an extinct genus of large carnivorous theropod dinosaurs of the Middle Jurassic Epoch of southern England. Although fossils from other areas have been assigned to the genus, the only certain remains of Megalosaurus come from Oxfordshire and date to the late Middle Jurassic.",
      "size": "6 meters long",
      "weight": "1 ton",
      "diet": "carnivore",
      "location": "Europe (Southern England)",
      "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/bb/Megalosaurus_dinosaur.png/500px-Megalosaurus_dinosaur.png"
    },
    {
      "id": 16,
      "name": "Metriacanthosaurus",
      "description": "Metriacanthosaurus is a genus of metriacanthosaurid dinosaur from the Oxford Clay Formation of England, dating to the Late Jurassic period, about 160 million years ago. It is the only named metriacanthosaurid known outside of Asia.",
      "size": "8 meters long",
      "weight": "1.5 tons",
      "diet": "carnivore",
      "location": "Europe",
      "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/6d/Metriacanthosaurus.jpg/500px-Metriacanthosaurus.jpg"
    },
    {
      "id": 17,
      "name": "Sarcosaurus",
      "description": "Sarcosaurus is a genus of basal neotheropod dinosaur, roughly 3.5 metres long. It lived in what is now England and maybe Ireland and Scotland during the Hettangian-Sinemurian stages of the Early Jurassic, about 199-196 million years ago.",
      "size": "3.5 meters long",
      "weight": "55 kg",
      "diet": "carnivore",
      "location": "Europe (England)",
      "image": "https://en.wikipedia.org/wiki/File:Sarcosaurus_life_restoration.jpg"
    },
    {
      "id": 18,
      "name": "Saurophaganax",
      "description": "Saurophaganax is a dubious, chimeric genus of large saurischian dinosaur, possibly a sauropod, from the Late Jurassic Morrison Formation of Oklahoma, United States.",
      "size": "10 meters long",
      "weight": "3 tons",
      "diet": "carnivore",
      "location": "North America",
      "image": "https://www.paleontologyworld.com/sites/default/files/Saurophaganax%20%20BBC%20Planet%20Dinosaur.png"
    },
    {
      "id": 19,
      "name": "Stegosaurus",
      "description": "Stegosaurus is a genus of herbivorous, four-legged, armored dinosaur from the Late Jurassic, characterized by the distinctive kite-shaped upright plates along their backs and spikes on their tails. The name 'Stegosaurus' means 'roof lizard', referring to the plates that resemble a roof.",
      "size": "7 meters long",
      "weight": "4 tons",
      "diet": "herbivore",
      "location": "North America, Europe, Asia",
      "image": "https://upload.wikimedia.org/wikipedia/commons/d/d8/Stegosaurus_stenops_Life_Reconstruction.png"
    },
    {
      "id": 20,
      "name": "Vulcanodon",
      "description": "Vulcanodon is an extinct genus of sauropod dinosaur from the Early Jurassic Uppermost Forest Sandstone of southern Africa. The only known species is V. karibaensis. Discovered in 1969 in Zimbabwe, it was regarded as the earliest-known sauropod for decades, and is still one of the most primitive sauropods that has been discovered.",
      "size": "6 meters long",
      "weight": "3 tons",
      "diet": "herbivore",
      "location": "Africa",
      "image": "https://www.activewild.com/wp-content/uploads/2018/12/Vulcanodon.jpg"
    }
  ]
}